{
  "backend/main.mo": "Actor exposes deployApp with domain-name validation enforcing length and allowed characters, trapping on errors.",
  "backend/migration.mo": "Simple migration module returning state unchanged.",
  "feature_evidence.json": "Report linking a deployment-domain feature to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend components, utilities, and deployment-domain feature files.",
  "frontend/index.css": "Global Tailwind base styles defining theme variables, dark mode tokens, and shared element styling.",
  "frontend/index.html": "HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Main app managing Valentine interactions and footer domain dialog.",
  "frontend/src/features/deployment/DeploymentDomainDialog.tsx": "Dialog UI for entering, validating, and submitting a deployment domain to the backend.",
  "frontend/src/features/deployment/validateDomain.ts": "Validates domain strings for length and character rules, returning an error or null.",
  "frontend/src/features/valentine/components/CTAButtons.tsx": "Renders Yes and fleeing No buttons hooking into user interaction handlers.",
  "frontend/src/features/valentine/components/MemeReveal.tsx": "Displays success message once the user selects Yes.",
  "frontend/src/features/valentine/components/NoConfirmationOverlay.tsx": "Modal overlay prompting reconsideration when No is selected.",
  "frontend/src/features/valentine/components/ParallaxHeartsBackground.tsx": "Canvas animation rendering floating, rotating heart shapes.",
  "frontend/src/features/valentine/hooks/useFleeingButton.ts": "Hook calculating random button repositioning when the pointer approaches.",
  "frontend/src/features/valentine/index.ts": "Barrel export for Valentine feature components and hook.",
  "frontend/src/features/valentine/utils/pointer.ts": "Provides helpers to get pointer coordinates, compute distances, and clamp numeric values.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider with login, logout, and identity restoration logic.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed for the Valentine app.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom Valentine-themed color variables plus gradient and text utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, shadows, and Valentine theme extensions.",
  "project_state.json": "Project metadata describing features, constraints, and current implementation state for the Valentine app."
}