{
  "backend/main.mo": "Motoko backend actor validates domain names and deploys apps, rejecting invalid names via Runtime.trap.",
  "feature_evidence.json": "Feature evidence report linking Valentine UI behaviors to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose across Valentine UI and deployment features.",
  "frontend/index.css": "Tailwind CSS root theme and dark mode color tokens with global styling rules.",
  "frontend/index.html": "HTML entry point mounting the SPA and loading the main React script.",
  "frontend/src/App.tsx": "Main React app showing Valentine prompt, CTA buttons, meme reveal, and deployment dialog.",
  "frontend/src/features/deployment/DeploymentDomainDialog.tsx": "Dialog allowing users to enter and validate a domain name and trigger backend deployment.",
  "frontend/src/features/deployment/validateDomain.ts": "Client-side domain validator enforcing length and allowed‑character rules.",
  "frontend/src/features/valentine/components/CTAButtons.tsx": "Renders Yes and fleeing No buttons using pointer movement and touch interactions.",
  "frontend/src/features/valentine/components/MemeReveal.tsx": "Displays success message after Yes is clicked.",
  "frontend/src/features/valentine/components/NoConfirmationOverlay.tsx": "Empty placeholder; component removed.",
  "frontend/src/features/valentine/components/ParallaxHeartsBackground.tsx": "Animated canvas rendering floating hearts with parallax motion.",
  "frontend/src/features/valentine/hooks/useFleeingButton.ts": "Hook computing random repositioning for the fleeing No button on proximity or touch.",
  "frontend/src/features/valentine/index.ts": "Barrel exports Valentine components and hook.",
  "frontend/src/features/valentine/utils/pointer.ts": "Pointer utilities for coordinate extraction, distance calculation, and clamping.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using React Query, and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity restoration, and status tracking via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file exporting nothing, as no backend queries are required.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive theme variables, including Valentine-themed colors and gradient utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders the root component.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, Valentine color variables, extended utilities, and plugins.",
  "project_state.json": "Stores project metadata, feature definitions, constraints, and known issues for the Valentine’s Day app."
}